## Plan Result (nonprod_general - TerraformPlanApply)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 9 to add, 4 to change, 9 to destroy.</code></pre>

* Update
  * azurerm_application_gateway.ag
  * azurerm_key_vault.atlassian_kv
  * azurerm_postgresql_flexible_server.atlassian-flex-server
  * azurerm_postgresql_server.atlassian-server
* Replace
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-confluence-04&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-crowd-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-gluster-03&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-01&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-02&#34;]
  * terraform_data.vm[&#34;atlassian-nonprod-jira-03&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-FLEX-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-FLEX-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-FLEX-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-PASS will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-PASS" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-PASS"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.POSTGRES-SINGLE-SERVER-USER will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "POSTGRES-SINGLE-SERVER-USER" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "nonprod-POSTGRES-SINGLE-SERVER-USER"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_private_key will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_private_key" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "test-private-key"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.admin_username will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "admin_username" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
      + name                    = "vm-admin-username"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (8 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

        # (18 unchanged blocks hidden)
    }

  # azurerm_key_vault.atlassian_kv will be updated in-place
  ~ resource "azurerm_key_vault" "atlassian_kv" {
      ~ access_policy                   = [
            {
                application_id          = null
                certificate_permissions = []
                key_permissions         = []
                object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          + {
              + certificate_permissions = []
              + key_permissions         = []
              + object_id               = "345d18cb-dabd-48f4-80fc-ea735abf14f1"
              + secret_permissions      = [
                  + "Get",
                  + "List",
                  + "Set",
                  + "Delete",
                  + "Purge",
                ]
              + storage_permissions     = []
              + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
            # (2 unchanged elements hidden)
        ]
        id                              = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.KeyVault/vaults/atlasssian-nonprod-kv"
        name                            = "atlasssian-nonprod-kv"
        tags                            = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_flexible_server.atlassian-flex-server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "atlassian-flex-server" {
      ~ administrator_password        = (sensitive value)
        id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/flexibleServers/atlassian-nonprod-flex-server"
        name                          = "atlassian-nonprod-flex-server"
        tags                          = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (16 unchanged attributes hidden)

      ~ authentication {
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_postgresql_server.atlassian-server will be updated in-place
  ~ resource "azurerm_postgresql_server" "atlassian-server" {
      ~ administrator_login_password      = (sensitive value)
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.DBforPostgreSQL/servers/atlassian-nonprod-server"
        name                              = "atlassian-nonprod-server"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (15 unchanged attributes hidden)
    }

  # terraform_data.vm["atlassian-nonprod-confluence-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "68a6a061-9a72-3433-0557-748fd634c1db" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-confluence-04"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "e89354f9-90c4-9878-aab0-1db7bb623cad" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-crowd-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "c36cb95c-0878-c174-3e5c-e7b494ac443c" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "f4caca4d-5bf4-35a3-2560-17fc61142f2a" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "1c138d0e-3b47-7e44-d64f-f67098f71e27" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-gluster-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "dd975537-e27b-05e5-9c64-e05b87c1f97a" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-01"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "4e53ef16-bf77-8763-140e-cb3600327a1f" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-02"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "52b93271-6601-a80b-5717-2a1d784b85f3" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

  # terraform_data.vm["atlassian-nonprod-jira-03"] must be replaced
-/+ resource "terraform_data" "vm" {
      ~ id               = "07127d69-44d7-5163-75b7-5bae993b1a53" -> (known after apply)
      ~ triggers_replace = [
          ~ "249e5189ac4fc3c26195569da8c934b1" -> "722e5651a00e32952f68ee590f389546",
          ~ "e91ce704dd0ab233cf6e195ced39d563" -> "fb78d505115053de8c524bd5f9abeee0",
            "349f304f3bfba9f9493aabde45f5407b",
          ~ "adf9e6cfb706d5eb9d36608f62f384fb" -> "c5a6e415430a6a019bed7b7c5484de9d",
          ~ "4209a6eb78cd20f33d40e9d799e4e7f8" -> "53ec607992d0d8c1390666080cd63809",
        ]
    }

Plan: 9 to add, 4 to change, 9 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":62,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->